import { Coordinates } from './region.types';

export const UNIVERSITY_COORDS: Record<string, Record<string, Coordinates>> = {
  sogang: {
    정문: {
      lat: 37.55163522335471,
      lng: 126.9379253142558,
    },

    후문: { lat: 37.55076968374614, lng: 126.94396911091565 },
    남문: { lat: 37.549498613173434, lng: 126.938995357633 },
  },

  hongik: {
    정문: { lat: 37.55275180872968, lng: 126.92443913897051 },
    상수역: { lat: 37.54776618366393, lng: 126.92242989321456 },
  },

  yonsei: {
    정문: { lat: 37.5600283622505, lng: 126.93688162053782 },
    서문: { lat: 37.563774906163886, lng: 126.93395373517579 },
  },

  ewha: {
    정문: { lat: 37.55942365921526, lng: 126.94566937595 },
  },

  sinchon: {
    신촌역: { lat: 37.55519803940573, lng: 126.93698092718137 },
  },

  hapjeong: {
    합정역: { lat: 37.5499134480298, lng: 126.91445460253196 },
  },
};
